// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math.
// В залежності від того що передали в функцію має виводити наступні повідомлення:
// — Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
// — Якщо передали не число - Повинно бути числове значення.
// — Якщо число менше 0 - Введіть додатнє число.
// — Якщо в функцію нічого не передали - Будь ласка, введіть число!
function getSqrt(number) {
    if (number == undefined) {
        return 'Вы ничего не передали, пожалуйста, укажите число';
    }
    else {
        if (number < 0) {
            return 'Укажите положительное число';
        }
        else {
            if (typeof number != "number") {
                return 'Укажите число';
            }
            else {
                return `корень числа ${number} равен ${Math.sqrt(number)}`;
            }
        }
    }
}
